PinkFluffyUnic0rn/stm32flight/main.c
	// update motors thrust based on calculated values. For
	// quadcopter it's enought to split correction in half for
	// 3 pairs of motors: left and right for roll, top and bottom
	// for pitch and two diagonals (spinning in oposite directions)
	// for yaw.
	setthrust(en * ltm * (thrustcor + 0.5 * rollcor
			+ 0.5 * pitchcor - 0.5 * yawcor),
		en * rtm * (thrustcor - 0.5 * rollcor
			+ 0.5 * pitchcor + 0.5 * yawcor),	
		en * lbm * (thrustcor + 0.5 * rollcor
			- 0.5 * pitchcor + 0.5 * yawcor),
		en * rbm * (thrustcor - 0.5 * rollcor
			- 0.5 * pitchcor - 0.5 * yawcor));

	// update loops counter
	++loops;

	return 0;
}

/**
* @brief Check if ERLS connection is alive, disarm if not. Callback
	for TEV_CHECK periodic event.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int checkconnection(int ms)
{
	// decrease ERLS timeout counter
	if (elrstimeout != 0)
		--elrstimeout;

	// if timeout conter reached 0 and no ERLS
	// packet came, disarm immediately
	if (elrstimeout <= 0) {
		emergencydisarm = 1;
		setthrust(0.0, 0.0, 0.0, 0.0);
		en = 0.0;
	}

	// since it runs every 1 second update loop counter here too
	loopscount = loops;
	loops = 0;

	return 0;
}

/**
* @brief Get readings from barometer. Callback for
	TEV_DPS periodic event.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int dpsupdate(int ms)
{
	struct dps_data hd;
	float alt;
	static float prevalt = 0.0;
	float dt;

	dt = ms / (float) TICKSPERSEC;

	dt = (dt < 0.000001) ? 0.000001 : dt;

	// if barometer isn't initilized, return
	if (dev[DEV_DPS].status != DEVSTATUS_INIT)
		return 0;

	// read barometer values
	dev[DEV_DPS].read(dev[DEV_DPS].priv, &hd,
		sizeof(struct dps_data));

	// write barometer temperature and altitude values into log
	log_write(LOG_BAR_TEMP, hd.tempf);
	log_write(LOG_BAR_ALT, hd.altf);

	// update altitude low-pass filter and temperature reading
	alt = dsp_updatelpf(lpf + LPF_ALT, hd.altf);
	dsp_updatelpf(lpf + LPF_BARTEMP, hd.tempf);

	// calculate climb rate from vertical acceleration and
	// barometric altitude defference using complimentary filter
	dsp_updatecompl(cmpl + CMPL_CLIMBRATE,
		9.80665 * (dsp_getlpf(lpf + LPF_VAU) + goffset - 1.0) * dt,
			(dsp_getcompl(cmpl + CMPL_ALT) - prevalt) / dt);
	
	// calculate presice altitiude from climb rate and
	// barometric altitude using complimentary filter
	dsp_updatecompl(cmpl + CMPL_ALT,
		dsp_getcompl(cmpl + CMPL_CLIMBRATE) * dt,
		alt);
	
	prevalt = dsp_getcompl(cmpl + CMPL_ALT);

	// write climbrate and altitude values into log
	log_write(LOG_CLIMBRATE, dsp_getcompl(cmpl + CMPL_CLIMBRATE));
	log_write(LOG_ALT, dsp_getcompl(cmpl + CMPL_ALT));

	return 0;
}

/**
* @brief Get readings from magnetomer. Callback for TEV_QMC
	periodic event.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int qmcupdate(int ms)
{
	// if magnetometer isn't initilized, return
	if (dev[DEV_QMC].status != DEVSTATUS_INIT)
		return 0;

	// read magnetometer values
	dev[DEV_QMC].read(dev[DEV_QMC].priv, &qmcdata,
		sizeof(struct qmc_data));

	qmcdata.fx += st.adj.magthrsc.x * dsp_getlpf(lpf + LPF_AVGTHR);

	// write magnetometer values into log
	log_write(LOG_MAG_X, qmcdata.fx);
	log_write(LOG_MAG_Y, qmcdata.fy);
	log_write(LOG_MAG_Z, qmcdata.fz);

	dsp_updatelpf(lpf + LPF_MAGX, qmcdata.fx);
	dsp_updatelpf(lpf + LPF_MAGY, qmcdata.fy);
	dsp_updatelpf(lpf + LPF_MAGZ, qmcdata.fz);

	return 0;
}

/**
* @brief Update log frame. If buffer isn't full, just move
	buffer pointer, otherwise save buffer content into flash and
	set buffer pointer to 0.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int logupdate(int ms)
{
	log_update();

	return 0;
}

/**
* @brief Send telemetry through ELRS.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int telesend(int ms)
{
	const char *attmodestr[] = {"ac", "st", "sp", "ps"};
	const char *yawmodestr[] = {"sp", "cs"};
	const char *altmodestr[] = {"tr", "cl", "al"};
	const char *am;

	tele.bat = dsp_getlpf(lpf + LPF_BAT);
	tele.curr = dsp_getlpf(lpf + LPF_CUR);

	if (tele.bat < 6.0)
		tele.batrem = (tele.bat - 3.5) / 0.7;
	else if (tele.bat < 9.0)
		tele.batrem = (tele.bat - 7.0) / 1.4;
	else if (tele.bat < 13.5)
		tele.batrem = (tele.bat - 10.5) / 2.1;
	else if (tele.bat < 18.0)
		tele.batrem = (tele.bat - 14) / 2.8;
	else
		tele.batrem = (tele.bat - 21) / 3.5;

	tele.batrem = trimf(100.0 * tele.batrem, 0.0, 100.0);

	tele.lat = gnss.lat + gnss.latmin / 60.0;
	tele.lon = gnss.lon + gnss.lonmin / 60.0;
	tele.speed = gnss.speed;
	tele.course = gnss.course;
	tele.alt = gnss.altitude;
	tele.sats = gnss.satellites;
	tele.balt = dsp_getcompl(cmpl + CMPL_ALT) - alt0;
	tele.vspeed = dsp_getcompl(cmpl + CMPL_CLIMBRATE);
	tele.roll = dsp_getcompl(cmpl + CMPL_ROLL) - st.adj.att0.roll;
	tele.pitch = dsp_getcompl(cmpl + CMPL_PITCH)
		- st.adj.att0.pitch;
	tele.yaw = circf(dsp_getcompl(cmpl + CMPL_YAW)
		- st.adj.att0.yaw);

	// fill flight mode string with arm state and
	// combination of stabilization modes codes
	if (altmode == ALTMODE_ACCEL)
		am = altmodestr[0];
	else if (altmode == ALTMODE_SPEED)
		am = altmodestr[1];
	else if (altmode == ALTMODE_POS)
		am = altmodestr[2];
	else
		am = "---";

	snprintf((char *) tele.mode, 14, "%c|%s|%s|%s",
		en > 0.5 ? 'a' : 'n',
		attmodestr[speedpid ? 0 : 1],
		yawmodestr[yawspeedpid ? 0 : 1], am);

	// in case of emergency disarming
	// set flight mode to "stopped"
	if (emergencydisarm)
		strcpy((char *) tele.mode, "stopped");

	dev[DEV_CRSF].write(dev[DEV_CRSF].priv, &tele,
		sizeof(struct crsf_tele));

	return 0;
}

/**
* @brief Update battery voltage and current.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int powercheck(int ms)
{
	dsp_updatelpf(lpf + LPF_BAT, batteryvoltage());
	dsp_updatelpf(lpf + LPF_CUR, esccurrent());

	return 0;
}

/**
* @brief Move to next point in autopilot track.
* @return always 0
*/
int autopilotstep()
{
	autopilottimer = 0;
	++curpoint;

