PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

/**
* @brief Update control values when moving in autopilot mode.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int autopilotupdate(int ms)
{
	struct trackpoint *nextpoint;
	float dt;

	dt = ms / (float) TICKSPERSEC;
	
	if (!autopilot || pointscount == 0 || curpoint < 0
			|| curpoint >= pointscount) {
		return 0;
	}

	nextpoint = points + curpoint + 1;
	if (nextpoint->type == AUTOPILOT_START)
		autopilottimer = 0.0;
	else if (nextpoint->type == AUTOPILOT_TAKEOFF) {
		thrust = autopilottimer * nextpoint->takeoff.alt
			/ nextpoint->takeoff.t;
		
	//	pitchtarget = 0.0;
		
		autopilottimer += dt;

		if (autopilottimer > nextpoint->takeoff.t)
			autopilotstep();
	}
	else if (nextpoint->type == AUTOPILOT_HOVER) {
		thrust = nextpoint->hover.alt;
		
	//	pitchtarget = 0.0;
		yawtarget = atan2f(nextpoint->hover.x,
			nextpoint->hover.y);
		
		autopilottimer += dt;

		if (autopilottimer > nextpoint->hover.t)
			autopilotstep();
	}
	else if (nextpoint->type == AUTOPILOT_LANDING) {
		if (dsp_getcompl(cmpl + CMPL_ALT) - alt0 > 5.0)
			thrust -= dt;
		else if (dsp_getcompl(cmpl + CMPL_ALT) - alt0 > 5.0)
			thrust -= dt * 0.5;
		else if (dsp_getcompl(cmpl + CMPL_ALT) - alt0 > 2.0)
			thrust -= dt * 0.25;
		else
			thrust -= dt * 0.125;
		
	//	pitchtarget = 0.0;
		
		if (dsp_getcompl(cmpl + CMPL_ALT) - alt0 <= 0.1)
			autopilotstep();
	}
	else if (nextpoint->type == AUTOPILOT_STOP) {
		thrust = -1.0;
	}
	else if (nextpoint->type == AUTOPILOT_FORWARD) {
/*
		float dx, dy;
	
		pitchtarget = M_PI / 12.0;
		
		yawtarget = atan2f(nextpoint->forward.x,
			nextpoint->forward.y);

		dx = nextpoint->forward.x - points[curpoint].forward.x;
		dy = nextpoint->forward.y - points[curpoint].forward.y;

		if (forwardpath > sqrtf(dx * dx + dy * dy))
*/
		autopilotstep();
	}

	return 0;
}

/**
* @brief Set control values using CRSF packet.
* @param cd -- CRSF packet
* @param ms -- microsecond passed from last CRSF packet
* @return always 0
*/
int crsfcmd(const struct crsf_data *cd, int ms)
{
	static float slottimeout = ELRS_PUSHTIMEOUT;
	float dt;
	int slot;

	// write first 8 channels values into log	
	log_write(LOG_CRSFCH0, cd->chf[ERLS_CH_ROLL]);
	log_write(LOG_CRSFCH1, cd->chf[ERLS_CH_PITCH]);
	log_write(LOG_CRSFCH2, cd->chf[ERLS_CH_THRUST]);
	log_write(LOG_CRSFCH3, cd->chf[ERLS_CH_YAW]);
	log_write(LOG_CRSFCH4, cd->chf[ERLS_CH_YAWMODE]);
	log_write(LOG_CRSFCH5, cd->chf[ERLS_CH_ATTMODE]);
	log_write(LOG_CRSFCH6, cd->chf[ERLS_CH_THRMODE]);
	log_write(LOG_CRSFCH7, cd->chf[ERLS_CH_ONOFF]);

	// channel 8 on remote is used to turn on/off
	// erls control. If this channel has low state, all remote
	// commands will be ignored, but packet still continue to
	// comming
	elrs = (cd->chf[ERLS_CH_ONOFF] > 0.5) ? 1 : 0;

	// update ERLS timeout as we got packet
	elrstimeout = ELRS_TIMEOUT;

	if (!elrs) {
		en = 0.0;
		setthrust(0.0, 0.0, 0.0, 0.0);

		return 0;
	}

	// get time passed from last ERLS packet
	dt = ms / (float) TICKSPERSEC;

	// channel 16 is used to select settings slot, it is
	// a 6 position switch on remote used for testing
	if (cd->chf[ERLS_CH_SETSLOT] < -0.8)		slot = 0;
	else if (cd->chf[ERLS_CH_SETSLOT] < -0.4)	slot = 1;
	else if (cd->chf[ERLS_CH_SETSLOT] < 0)		slot = 2;
	else if (cd->chf[ERLS_CH_SETSLOT] < 0.4)	slot = 3;
	else if (cd->chf[ERLS_CH_SETSLOT] < 0.8)	slot = 4;
	else						slot = 5;

	// slot changed differ from current, wait some time to
	// ensure that it's not a some error, if enough time passed,
	// load settings from choosen slot
	if (slot != curslot) {
		slottimeout -= dt;

		if (slottimeout <= 0.0) {
			readsettings(slot);
			setstabilize(0);

			curslot = slot;
		}
	} else
		slottimeout = ELRS_PUSHTIMEOUT;

	if (cd->chf[ERLS_CH_AUTOPILOT] > 0.0) {
		if (autopilot == 0)
			curpoint = 0;

		autopilot = 1;
	}
	else
		autopilot = 0;

	// set magnetometer stabilization mode, if channel 4 has value
	// more than 0, set gyroscope only stabilization mode otherwise
	if (autopilot) {
	//	yawtarget = 0.0;
		yawspeedpid = 0;
	}
	else 
	if (cd->chf[ERLS_CH_YAWMODE] > 0.0) {
		yawspeedpid = 0;

		// in magnetometer stabilization mode absolute yaw
		// value is stabilized, so target should be integrated
		yawtarget = circf(yawtarget
			+ cd->chf[ERLS_CH_YAW] * dt * M_PI
				* st.ctrl.yawposrate);
	}
	else {
		yawspeedpid = 1;
		yawtarget = -cd->chf[ERLS_CH_YAW]
			* M_PI * st.ctrl.yawrate;
	}

	// set altitude hold mode, if channel 7 has value more than 25,
	// set climbrate stabilization mode if channel 7 has value
	// between -25 and 25, set vertical acceleration mode if channel
	// 7 value is less than -25
	if (autopilot) {
		altmode = ALTMODE_POS;
	}
	else if (cd->chf[ERLS_CH_THRMODE] > 0.25) {
		altmode = ALTMODE_POS;
		thrust = (cd->chf[ERLS_CH_THRUST] + 1.0)
			/ 2.0 * st.ctrl.altmax;
	}
	else if (cd->chf[ERLS_CH_THRMODE] < -0.25) {
		altmode = ALTMODE_ACCEL;

		if (cd->chf[ERLS_CH_HOVER] < 0.0) {
			hovermode = 0;
			thrust = (cd->chf[ERLS_CH_THRUST] + 0.5)
				/ 1.5 * st.ctrl.accelmax;
		}
		else {
			hovermode = 1;

			thrust = (cd->chf[ERLS_CH_THRUST])
				/ 2.0 * st.ctrl.accelmax;
		}

	}
	else {
		altmode = ALTMODE_SPEED;
		thrust = cd->chf[ERLS_CH_THRUST] * st.ctrl.climbratemax;
	}

	// if channel 9 is active (it's no-fix button on remote used
	// for testing), set reference altitude from current altitude
	if (cd->chf[ERLS_CH_ALTCALIB] > 0.0) {
		alt0 = dsp_getcompl(cmpl + CMPL_ALT);
		goffset = 1.0 - dsp_getlpf(lpf + LPF_VAAVG);
		faoffset = dsp_getlpf(lpf + LPF_FA);
	}

	// set acceleromter stabilization mode, if channel 6 has value
	// more than 25, set gyroscope only stabilization mode, if
	// channel 6 has value between -25 and 25, disarm if channel 6
	// value is less than -25
/*
	if (autopilot) {
		en = 1;
		speedpid = 0;

		rolltarget = cd->chf[ERLS_CH_ROLL]
			* (M_PI * st.rollmax);
	}
	else 
	*/	
	if (cd->chf[ERLS_CH_ATTMODE] > 0.25) {
		en = 1;
		speedpid = 0;

		// set pitch/roll targets based on
		// channels 1-2 values (it's a joystick on most remotes)
		rolltarget = cd->chf[ERLS_CH_ROLL]
			* (M_PI * st.ctrl.rollmax);
		pitchtarget = -cd->chf[ERLS_CH_PITCH]
			* (M_PI * st.ctrl.pitchmax);
	}
	else if (cd->chf[ERLS_CH_ATTMODE] < -0.25) {
		en = 0;
		speedpid = 0;
	}
	else {
		en = 1;
		speedpid = 1;

		// set pitch/roll targets based on
		// channels 1-2 values (it's a joystick on most remotes)
		rolltarget = cd->chf[ERLS_CH_ROLL]
			* (M_PI * st.ctrl.rollrate);
		pitchtarget = -cd->chf[ERLS_CH_PITCH]
			* (M_PI * st.ctrl.pitchrate);
	}

